---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Room.BaseOffset
zh: 房间
source: html/1ee9db0a-558c-e44a-97af-eadc5cafff76.htm
---
# Autodesk.Revit.DB.Architecture.Room.BaseOffset Property

**中文**: 房间

Get or Set the Base Offset of the Room.

## Syntax (C#)
```csharp
public double BaseOffset { get; set; }
```

## Remarks
This property is used to get or set the Base Offset of the Room.